import React from 'react';

const Info = ({selectedAgree, user}) => {
    let userType = selectedAgree && selectedAgree.userType;
    return (
        <div className="lk-main__info short-padding mb-small ">
            <div className="lk-main__info-body">
                <h1 className="small-title lk-main__info-title">{user.name}</h1>
                {userType === 0 && <p className="small-text text-grey">Физическое лицо</p>}
                {userType === 1 && <p className="small-text text-grey">Индивидуальный предприниматель</p>}
                {userType >= 2 && <p className="small-text text-grey">Юридическое лицо</p>}
            </div>
            
            {user.img 
                ? <img src={user.img} alt={user.name} className="lk-main__info-icon" />
                : <svg className="lk-main__info-icon" width="113" height="115" viewBox="0 0 113 115" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clipPath="url(#clip0)">
                        <path d="M56.5 112.909C87.7041 112.909 113 87.6335 113 56.4545C113 25.2756 87.7041 0 56.5 0C25.2959 0 0 25.2756 0 56.4545C0 87.6335 25.2959 112.909 56.5 112.909Z" fill="#F2F4F5"/>
                        <path d="M94.9773 92.6737C92.6144 90.8255 89.7355 89.4947 86.6121 88.8495L71.7218 85.8924C70.1601 85.5967 69.033 84.2122 69.033 82.5992V79.2187C69.9904 77.8879 70.8935 76.1204 71.8373 74.2722C72.5706 72.8406 73.6773 70.6833 74.2273 70.1254C77.242 67.128 80.1549 63.7609 81.058 59.4192C81.8999 55.3465 81.0715 53.2092 80.1006 51.4887C80.1006 47.1941 79.9648 41.8175 78.9395 37.906C78.8173 32.6101 77.8463 29.6328 75.402 27.0251C73.6773 25.1769 71.1379 24.7467 69.0941 24.404C68.2929 24.2696 67.1862 24.0814 66.7788 23.8663C63.1597 21.9307 59.5814 20.9831 55.3106 20.9092C46.3682 21.2721 35.3754 26.9041 31.6952 36.945C30.5545 40.0029 30.6699 45.0233 30.765 49.0558L30.6767 51.482C29.8008 53.1756 28.9385 55.3263 29.7873 59.4125C30.6835 63.7609 33.5964 67.1347 36.6654 70.1725C37.1679 70.6833 38.3018 72.8608 39.0487 74.2991C40.0061 76.1405 40.9159 77.9014 41.8733 79.2254V82.6059C41.8733 84.2122 40.7394 85.5967 39.1709 85.8991L24.2671 88.8563C21.1641 89.5082 18.2851 90.8255 15.929 92.6737C15.1957 93.2584 14.734 94.1119 14.6593 95.0394C14.5846 95.9668 14.897 96.8742 15.5284 97.5664C25.6726 108.642 40.2234 115 55.4532 115C70.683 115 85.2406 108.649 95.3779 97.5664C96.0094 96.8742 96.3285 95.9601 96.247 95.0327C96.1723 94.1052 95.7106 93.2517 94.9773 92.6737Z" fill="#BECCD2"/>
                    </g>
                    <defs>
                        <clipPath id="clip0">
                            <rect width="113" height="115" fill="white"/>
                        </clipPath>
                    </defs>
                </svg>}
            
        </div>
    );
}

export default Info;